edited readme and added diagram
